app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "updated_at", "account_id", "last_name", "email_address", "login", "first_name") VALUES('2010-02-28 16:47:29', '2010-02-28 16:47:29', NULL, 'Broad-Crawford', 'anthony@anthony.com', 'broadcrawford', 'Anthony')
---
  def create
    session[:registration_params].deep_merge!(params[:registration]) if params[:registration]
    @registration = Registration.new(session[:registration_params])
    @registration.current_step = session[:registration_step]
    if @registration.valid?
      if (@registration.current_step == 'personal_info')
        @registration.save!